Revit 2026 API

# EnergyDataSettingsSillHeight Property

---

Used for the conceptual energy model. The height from the nearest lower level used for auto-glazing created on walls.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SillHeight { get; set; }
```
```vb
Public Property SillHeight As Double
	Get
	Set
```
```cpp
public:
property double SillHeight {
	double get ();
	void set (double value);
}
```
```fsharp
member SillHeight : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The sill height is less than zero. |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace